Revit 2027 API
AnalysisDisplayColorSettings.AreIntermediateColorsValid Method
 Verify intermediate color entries
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry> map
)
Public Function AreIntermediateColorsValid (
	map As IList(Of AnalysisDisplayColorEntry)
) As Boolean
public:
bool AreIntermediateColorsValid(
	IList<AnalysisDisplayColorEntry^>^ map
)
member AreIntermediateColorsValid :
        map : IList<AnalysisDisplayColorEntry> -> bool
Parameters
map IList<AnalysisDisplayColorEntry>
 Array of intermediate color entries.
Return Value
Boolean
 True if intermediate colors are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace